import { DialogTitle } from '@/shared/ui/dialog';
import { FC } from 'react';
import { ContractViewModel } from './contract-dto';

interface Props {
  data: ContractViewModel;
}

const PDFTemplate: FC<Props> = ({ data }) => {
  const { landlord, tenant, property, terms, meters } = data;

  return (
    <div className="text-text">
      <DialogTitle>ДОГОВІР ОРЕНДИ ПРИМІЩЕННЯ (КВАРТИРИ)</DialogTitle>
      <p className="text-[15px]">м. Рівне</p>
      <p className="text-[15px]">
        Ми, що нижче підписались П.І.П. {landlord.firstName} {landlord.lastName}, паспорт: серія
        {landlord.passportSeries}, № {landlord.passportNumber}, виданий {landlord.passportIssued},
        зареєстрований(а): {landlord.address}, що іменується надалі "ОРЕНДОДАВЕЦЬ", з однієї
        сторони, та П.І.П. {tenant.firstName} {tenant.lastName}, паспорт: серія{' '}
        {tenant.passportSeries}, №{tenant.passportNumber}, виданий {tenant.passportIssued},
        зареєстрований(а):
        {tenant.address}, що іменується надалі "ОРЕНДАР", з іншої сторони, уклали цей Договір про
        таке:
      </p>

      <h4 className="font-semibold mt-6 mb-2">1. ПРЕДМЕТ ДОГОВОРУ</h4>
      <ul className="ml-3 space-y-1">
        <li>
          1.1. Орендодавець передає Орендарю в тимчасове користування квартиру (офіс), будинок, що
          іменується надалі "ОРЕНДОВАНЕ ПРИМІЩЕННЯ", яке належить йому на підставі
          {property.ownershipDocument}, що складається з {property.roomCount} кімнат, загальною
          площею {property.area} кв.м., та знаходиться за адресою: м. Рівне, вул. {property.street},
          буд. {property.building}, кв. {property.apartment}.
        </li>
      </ul>

      <h4 className="font-semibold mt-6 mb-2">2. ПРАВА ТА ОБОВ’ЯЗКИ ОРЕНДОДАВЦЯ</h4>
      <ul className=" ml-3 space-y-1">
        <li>
          2.1. Надати приміщення у розпорядження Орендарю відразу після підписання цього договору.
        </li>
        <li>
          2.2. Своєчасно вносити плату за комунальні послуги (при відсутності заборгованості
          орендаря) та виконувати інші зобов’язання власника орендованого приміщення.
        </li>
        <li>2.3. Не відвідувати Об’єкт без попередньої домовленості з Орендарем.</li>
        <li>
          2.4. Надати Орендарю безплатно право користування загальними приміщеннями й устаткуванням,
          а саме: вестибюлем, сходами і проходами в будинку, сміттєпроводом.
        </li>
        <li>
          2.5. Орендодавець підтверджує, що здає в оренду орендоване приміщення нікому не продане,
          не дароване, не закладене, під забороною не знаходиться, в спорі, арешті та під забороною
          нічого немає.
        </li>
        <li className="ml-4">
          2.5.1. При намірі (рішенні) продати приміщення, яке знаходиться у розпорядженні
          орендодавця, він зобов’язаний попередити орендаря не менше ніж за 30 днів.
        </li>
        <li>
          2.6. Орендодавець підтверджує, що діє на підставі згоди всіх осіб, що мають право
          користування на вказані площі.
        </li>
      </ul>

      <h4 className="font-semibold mt-6 mb-2">3. ПРАВА ТА ОБОВ’ЯЗКИ ОРЕНДАРЯ</h4>
      <ul className=" ml-3 space-y-1">
        <li>
          3.1. Орендар бере на себе такі зобов’язання:
          <ul className="ml-4 space-y-1">
            <li>
              а) утримувати орендоване приміщення, та територію яка прилягає до нього (двір, гараж)
              в порядку, передбаченому санітарно-протиепідемічними нормами;
            </li>
            <li>
              б) не здавати в суборенду орендоване приміщення без дозволу Орендодавця, не
              перебудовувати, не проводити ремонт без дозволу згідно Орендодавця і не допускати його
              удачної;
            </li>
            <li>
              в) своєчасно вносити платежі, передбачені даним Договором; не порушувати тишу та
              спокій жителів сусідніх квартир;
            </li>
            <li>
              г) по закінченню терміну оренди здати орендоване приміщення і майно в тому стані, в
              якому воно було передано у користування з урахуванням природного зносу/Акт
              прийому-передачі стану приміщення та наявності побутової техніки, меблів — додається.
            </li>
          </ul>
        </li>
        <li>
          3.2. Орендар зобов’язується компенсувати вартість ремонту (при пошкодженні приміщення з
          вини орендаря), компенсувати вартість побутової техніки (при пошкодженні з вини орендаря)
          та компенсувати вартість меблів (при пошкодженні з вини орендаря).
        </li>
        <li className="ml-4">
          3.2.1. Зобов’язання Орендаря по проведенню або компенсації вартості ремонту не поширюється
          на результати природного зносу.
        </li>
        <li>
          3.3. Орендар несе повну матеріальну відповідальність за майно, що включено згідно акту
          приймання-передачі інвентарю.
        </li>
        <li>
          3.4. Допускати орендодавця на огляд приміщення в ті часи, що належать до нього, не частіше
          ніж {terms.inspectionCount} раз на місяць.
        </li>
      </ul>

      <h4 className="font-semibold mt-6 mb-2">4. ПОРЯДОК РОЗРАХУНКІВ</h4>
      <ul className=" ml-3 space-y-1">
        <li>
          4.1. Місячна ставка орендної плати складає {terms.rentPriceUah} грн, що в еквіваленті
          становить {terms.rentPriceUsd}
          доларів США за Курсом Національного банку України на день укладання цього Договору.
          Підставою для оплати послуг при оренді Орендодавця є даний Договір.
        </li>
        <li>
          4.2. В день підписання договору Орендар передає Орендодавцю {terms.initialPayment} грн.
        </li>
        <li>4.3. Залишена сума на майно, що знаходиться у квартирі — {terms.depositAmount} грн.</li>
        <li>
          4.4. У разі нанесення шкоди орендованому приміщенню (та його майну: меблям та побутовим
          приладам) за рахунок заставної суми та суми останнього місяця покриваються витрати, які
          можуть бути визнані винною дією Орендаря.
        </li>
        <li>
          4.5. Після закінчення строку дії договору залогова сума може бути зарахована на користь
          Орендаря.
        </li>
        <li>
          4.6. Орендар здійснює щомісячну оплату за комунальні послуги (включати: електроенергію,
          газ, водопостачання, газопостачання, теплозабезпечення, квартплату, домофон, КТБ,
          Internet, телебачення, сміття).
        </li>
        <li>
          4.7. Дані показників лічильників на момент підписання договору:
          <ul className=" ml-4 space-y-1">
            <li>електроенергія: {meters.electricity}</li>
            <li>газ: {meters.gas}</li>
            <li>холодна вода: {meters.coldWater}</li>
            <li>гаряча вода: {meters.hotWater}</li>
          </ul>
        </li>
        <li>
          4.8. Орендна плата проводиться (за домовленістю сторін, та визначеною датою) поточного
          місяця до {terms.paymentDeadlineDay} числа кожного місяця календарного року.
        </li>
      </ul>

      <h4 className="font-semibold mt-6 mb-2">5. РОЗІРВАННЯ ДОГОВОРУ</h4>
      <ul className=" ml-3 space-y-1">
        <li>
          5.1. Даний договір може бути розірваний з ініціативи кожної зі сторін при наявності умов і
          в порядку, передбаченому чинним законодавством.
        </li>
        <li>5.2. У будь-якій зі сторін за згодою сторін.</li>
        <li>
          5.3. При цьому зазначена сторона має право розірвати цей Договір, попередивши іншу Сторону
          за 30 днів наперед.
        </li>
        <li>5.4. При розірванні Договору сторони повинні провести взаємні розрахунки.</li>
      </ul>
    </div>
  );
};

export default PDFTemplate;
